Autodesk.Navisworks.Api.NamedConstant
A named integer constant with localized display name. Immutable.

Autodesk.Navisworks.Api.NamedConstant.#ctor(System.Int32,System.String)
Construct a named integer constant
value: Value of constant
baseName: Base name for constant - actual name will be "baseName:value"

Autodesk.Navisworks.Api.NamedConstant.#ctor(System.Int32,System.String,System.String)
Construct a named integer constant
value: Value of constant
baseName: Base name for constant - actual name will be "baseName:value"
displayName: Display name (may be overridden by localized version in .name file)

Autodesk.Navisworks.Api.NamedConstant.#ctor(System.String)
Construct a named integer constant with value 0
name: Name of constant

Autodesk.Navisworks.Api.NamedConstant.#ctor(System.String,System.String)
Construct a named integer constant with value 0
name: Name of constant
displayName: Display name (may be overridden by localized version in .name file)

Autodesk.Navisworks.Api.NamedConstant.BaseName
Base name for constant. Related constants (enumerations) have the same base name.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.NamedConstant.DisplayName
Display name of constant (localized)
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.NamedConstant.Equals(System.Object)
Determines whether the specified object and the current object refer to the same
underlying native object. Returns false if either object has been disposed.

Autodesk.Navisworks.Api.NamedConstant.GetHashCode
Serves as a hash function for a particular type.  is suitable for use in hashing algorithms and data structures like a hash table.
Returns: A hash code for the current .

Autodesk.Navisworks.Api.NamedConstant.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.NamedConstant.Name
Name of constant
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.NamedConstant.ToString
Returns a  that represents the current .
Returns: A  that represents the current .

Autodesk.Navisworks.Api.NamedConstant.UserEquals(Autodesk.Navisworks.Api.NamedConstant)
Is this constant the same as another constant.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'other' is null
Throws System.ArgumentException:
Argument 'other' has been Disposed

Autodesk.Navisworks.Api.NamedConstant.Value
Value of constant
Throws System.ObjectDisposedException:
Object has been Disposed